*>****************************************************************
*> Author: LUCAS CARDOSO
*> Date: 15/02/24
*> Purpose: UTILIZANDO O COMANDO PERFOM PARA CONSEGUIRMOS UTLIZAR TRECHOS DE CODIGOS EM DIFERENTES AREAS DO PROGRAMA
*> Tectonics: cobc
*>****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM_PROG.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.

PERFORM P3-INICIO THRU P3-FIM.
PERFORM P1-INICIO THRU P1-FIM.
PERFORM P2-INICIO THRU P2-FIM.
PERFORM P4-INICIO THRU P4-FIM.


P1-INICIO.
     DISPLAY '1'.
P1-FIM.

P2-INICIO.
     DISPLAY '2'.
P2-FIM.

P3-INICIO.
     DISPLAY '3'.

P3-FIM.

P4-INICIO.
     STOP RUN.
P4-FIM.
END PROGRAM PERFORM_PROG.
