*>****************************************************************
*> Author:
*> Date:
*> Purpose:
*> Tectonics: cobc
*>****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. BOLETIM.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 WS-AREA.
     03 WS-NOME     PIC X(30).
     03 WS-MATERIA  PIC X(30).
     03 WS-NOTA_1   PIC 99.
     03 WS-NOTA_2   PIC 99.
     03 WS-NOTA_3   PIC 99.
     03 WS-NOTA_4   PIC 99.
     03 WS-RESULT   PIC 99.
     03 WS-CONTINUA PIC X(1).

PROCEDURE DIVISION.
MAIN-PROCEDURE.

    INITIALISE WS-AREA

    PERFORM P100-INICIO.
    PERFORM P800-ERRO.



    P100-INICIO.
    DISPLAY "DIGITE O NOME DO ALUNO: "
    ACCEPT WS-NOME

     DISPLAY "DIGITE O NOME DA MATERIA: "
     ACCEPT WS-MATERIA

    DISPLAY "DIGITE A PRIMEIRA NOTA: "
    ACCEPT WS-NOTA_1


    DISPLAY "DIGITE A SEGUNDA NOTA: "
    ACCEPT WS-NOTA_2

    DISPLAY "DIGITE A TERCEIRA NOTA: "
    ACCEPT WS-NOTA_3

    DISPLAY "DIGITE A QUARTA NOTA: "
    ACCEPT WS-NOTA_4

    COMPUTE WS-RESULT = (WS-NOTA_1 + WS-NOTA_2 + WS-NOTA_3 + WS-NOTA_4) / 4.

    CALL 'CALCULO_MEDIA' USING WS-AREA

    DISPLAY "DESEJA CALCULAR OUTRA MEDIA? (S/N)"
         ACCEPT WS-CONTINUA


         IF WS-CONTINUA = 'S' THEN
            PERFORM P100-INICIO
         ELSE
            PERFORM P999-FIM.

    P800-ERRO.




    P999-FIM.
    STOP RUN.
END PROGRAM BOLETIM.
