*>****************************************************************
*> Author: LUCAS CARDOSO
*> Date: 14/03/24
*> Purpose: PROGRAMA CHAMADOR, CHAMA O PROGRAMA 'CHAMADO_PROG', OS DOIS PRECISAM ESTAR NO MESMO DIRETORIO PARA QUE OS BINS SEJAM CRIADOS JUNTOS
*> COPILE O CHAMADOR E O CHAMADO PARA GERAR AS DLL E ASSIM ELE VAI FUNCIONAR, EXECUTANDO O CHAMADOR ELE PASSA PARAMETROS PARA O CHAMADO,
*> QUE POR SUA VEZ RECEBE OS PARAMETROS E REALIZA UM CALCULO.
*> Tectonics: cobc
*>****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. CHAMADOR_PROG.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 WS-AREA.
     03 WS-RESULT        PIC 99.
     03 WS-NUM-1         PIC 99.
     03 WS-NUM-2         PIC 99.

PROCEDURE DIVISION.
MAIN-PROCEDURE.


    DISPLAY "PROGRAMA CHAMADOR"

    INITIALISE WS-AREA

    SET WS-NUM-1    TO 5
    SET WS-NUM-2    TO 3

    DISPLAY 'CHAMANDO PROGRAMA ...'
    CALL 'CHAMADO_PROG' USING WS-AREA

    DISPLAY 'PROGRAMA EXECUTADO COM SUCESSO'
                                    WS-RESULT
    STOP RUN.
END PROGRAM CHAMADOR_PROG.
