*>****************************************************************
*> Author: LUCAS CARDOSO
*> Date: 14/03/24
*> Purpose: PROGRAMA CHAMADOR, CHAMA O PROGRAMA 'CHAMADO_PROG', OS DOIS PRECISAM ESTAR NO MESMO DIRETORIO PARA QUE OS BINS SEJAM CRIADOS JUNTOS
*> COPILE O CHAMADOR E O CHAMADO PARA GERAR AS DLL E ASSIM ELE VAI FUNCIONAR, EXECUTANDO O CHAMADOR ELE PASSA PARAMETROS PARA O CHAMADO,
*> QUE POR SUA VEZ RECEBE OS PARAMETROS E REALIZA UM CALCULO.
*> Tectonics: cobc
*>*****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. CHAMADO_PROG.
DATA DIVISION.
WORKING-STORAGE SECTION.
LINKAGE SECTION.
01 PARAMETRES.
   02 WS-RETURN      PIC 99 VALUE 0.
   02 WS-NUM-1       PIC 99 VALUE 0.
   02 WS-NUM-2       PIC 99 VALUE 0.

PROCEDURE DIVISION USING PARAMETRES.
MAIN-PROCEDURE.
   DISPLAY "PROGRAMA CHAMADO"
   DISPLAY 'WS-NUM-1 RECEBEU: ' WS-NUM-1
   DISPLAY 'WS-NUM-2 RECEBEU: ' WS-NUM-2

   COMPUTE WS-RETURN = WS-NUM-1 + WS-NUM-2
   DISPLAY 'RESULTADO DA SOMA: ' WS-RETURN

   STOP RUN.
END PROGRAM CHAMADO_PROG.
