*>****************************************************************
*> Author: lUCAS CARDOSO
*> Date: 14/02/24
*> Purpose: COMANDOS DE ENCERRAMENTO
*> Tectonics: cobc
*>****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. COMANDOS_ENCERRAMENTO.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "Hello world"
    STOP RUN.
END PROGRAM COMANDOS_ENCERRAMENTO.
