*>****************************************************************
*> Author: LUCAS CARDOSO
*> Date: 15/02/24
*> Purpose: PROGRAMA ONDE EXEMPLIFICO O "MOVE" , MOVENDO VALORES E / PARA UMA VARIAVEL.
*> Tectonics: cobc
*>****************************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. DATA_PROG.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
77 WS-DATA PIC X(10) VALUE SPACES.
77 WS-DATA-COMPLETA PIC X(10) VALUES SPACES.
77 WS-NOVA-DATA PIC X(10) VALUE SPACES.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
*> CRIANDO VALORES COMO DATA E ATRIBUINDO A VARIAVEL, 01:02 SIGNIFICA A POSIÇÃO DO DADO E O NUMERO DE BITS
*> 15 ESTA NA PRIMEIRA POSIÇÃO E POSSUI DOIS BITS E ASSIM SUCESSIVAMENTE.
    MOVE "15"       TO WS-DATA(01:02).
    MOVE "/"        TO WS-DATA(03:01).
    MOVE "02"       TO WS-DATA(04:02).
    MOVE "/"        TO WS-DATA(06:01).
    MOVE "2024"     TO WS-DATA(07:04).

*> MOVENDO A APARTIR DE UMA VARIAVEL QUE JA RECEBEU UMA DATA DE SISTEMA PELO COMENADO ACCEPT,
*> VAMOS SEGUIR COMO O EXEMPLO ACIMA, LOCALIZANDO OS DADOS
*> ATRIBUINDO SUAS POSIÇÕES E BITS

     ACCEPT WS-DATA-COMPLETA FROM DATE YYYYMMDD.

*>     DISPLAY WS-DATA-COMPLETA

     MOVE WS-DATA-COMPLETA(07:02)  TO WS-NOVA-DATA(01:02).
     MOVE "/"                      TO WS-NOVA-DATA(03:01).
     MOVE WS-DATA-COMPLETA(05:02)  TO WS-NOVA-DATA(04:02).
     MOVE "/"                      TO WS-NOVA-DATA(06:01).
     MOVE WS-DATA-COMPLETA(01:04)  TO WS-NOVA-DATA(07:04).

*> DISPLAY EXIBE O COMANDO DAS VARIAVEIS
    DISPLAY WS-NOVA-DATA ' data convertida manualmente'
    DISPLAY WS-DATA ' DATA CRIADA DO ZERO '
    STOP RUN.
END PROGRAM DATA_PROG.
